app/views/job_applications/new.html.erb

  </div>
  <%= f.collection_select :user_id, User.all, :id, :name %>
  <%= f.collection_select :job_posting_id, JobPosting.all, :id, :company %>
---
SELECT "users".* FROM "users"
SELECT "job_postings".* FROM "job_postings"