app/controllers/job_applications_controller.rb

    def show
        @job_application = JobApplication.find(params[:id])
---
SELECT "job_applications".* FROM "job_applications" WHERE "job_applications"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]

    def index
        @job_applications = JobApplication.all
---
SELECT "job_applications".* FROM "job_applications" WHERE (user_id = NULL)

    def create
        @job_application = JobApplication.new(job_application_params)
        if @job_application.save
---
INSERT INTO "job_applications" ("status", "description", "user_id", "job_posting_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["status", "Started"], ["description", "4tt443t"], ["user_id", 40], ["job_posting_id", 34], ["created_at", "2019-10-22 21:35:56.084821"], ["updated_at", "2019-10-22 21:35:56.084821"]]