app/controllers/job_postings_controller.rb

    def index
        @user = User.find(session[:user_id])
        @job_postings = JobPosting.all
---
SELECT "job_postings".* FROM "job_postings"

    def show
        @user = User.find(session[:user_id])
        @job_posting = JobPosting.find(params[:id])
---
SELECT "job_postings".* FROM "job_postings" WHERE "job_postings"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]