app/controllers/users_controller.rb

    def update
        @user = User.find(params[:id])
        if @user.update(user_params)
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "username" = ?, "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["username", "carmichaels"], ["password_digest", "$2a$10$CcPlILtuQgiODeu..qdNh.yuteDWN3c4K2IRZZxwRt/.KiO.gGHby"], ["updated_at", "2019-10-22 17:22:44.938243"], ["id", 1]]

    def create
        @user = User.new(user_params)
        if @user.save
---
INSERT INTO "users" ("username", "created_at", "updated_at") VALUES (?, ?, ?)  [["username", "Alec"], ["created_at", "2019-10-22 15:05:56.632527"], ["updated_at", "2019-10-22 15:05:56.632527"]]